[
{"name": "Mermaid Petal Cake", "ingredients": ["1 box vanilla cake mix, plus ingredients called for on box", "1 1/2 c. butter, softened", "6 c. powdered sugar", "2 tsp. pure vanilla extract", "6 tbsp. heavy cream", "1 tsp. purple gel food coloring", "1 tsp. Blue gel food coloring", "1 tsp. teal gel food coloring"], "steps": ["Preheat oven to 350°. Line two 8” round cake pans with parchment paper and grease with cooking spray.", "Prepare cake mix according to package instructions.", "Divide cake batter between prepared pans and bake according to package instructions.", "Let cakes cool in pans for 10 minutes, then invert onto wire racks to cool completely.", "Make frosting: In a large bowl using a hand mixer, beat butter and half of the powdered sugar until smooth. Add the remaining powdered sugar, vanilla and 4 tablespoons heavy cream and beat until fluffy. If the mixture is too stiff, add more heavy cream.", "Place a dab of frosting on cake plate (to keep cake in place) and place parchment strips on each side of the cake plate. Place down first cake and top with frosting, then top with second cake and frost with a thin crumb coat of frosting.", "Divide remaining frosting into three small bowls and stir one shade of gel food coloring into each bowl of frosting.", "Place each color of frosting into its own piping bag fitted with a large round piping tip.", "Starting at the top of one side of the cake, pipe a small circle of purple frosting. Directly underneath the purple frosting circle, pipe a small circle of blue frosting, following by a circle of teal frosting underneath. Continue in a vertical line in the same order of colors until you run out of space on the cake.", "Using an offset spatula, smear each circle of frosting horizontally across the side of the cake about 1 inch. Note: Use a different spatula for each color of frosting to avoid mixing the shades.", "Repeats steps 9 and 10, slightly overlapping the circles of frosting with the smeared frosting to create a mermaid-scale effect until you run out of space on the side of the cake.", " Repeat the same circle and smear technique with the frosting on top of the cake, but in concentric circles this time."], "content": ["Yields:  20", "Prep Time:     1 hr  ", "Total Time:     1 hr 30 mins"]},
{"name": "Watermelon Caprese", "ingredients": ["1 small watermelon, sliced", "1 mozzarella ball, sliced", "2 tbsp. sliced fresh basil", "Flaky sea salt", "Freshly ground black pepper", "extra-virgin olive oil", "balsamic glaze"], "steps": ["Slice watermelon into 1/2” thick squares, about 3”-x- 3”. Slice mozzarella into 1/2” slices.", "On a serving dish, alternate slices of mozzarella and watermelon. Sprinkle with basil, flaky sea salt and pepper. ", "Drizzle with olive oil and balsamic glaze and serve."], "content": ["Yields:  4", "Prep Time:       15 mins", "Total Time:       15 mins"]},
{"name": "Lunch Kebabs", "ingredients": ["Deli ham", "Cubed yellow cheddar", "White bread, cut into squares", "Bread & butter pickles", "Lettuce", "Deli turkey", "Cooked bacon", "Colby Jack, cut into cubes", "Whole-wheat bread, cut into squares", "Cubed avocado", "Cherry tomatoes", "Lettuce", "Salami", "String cheese, cut into cubes", "French bread, cut into squares", "Sliced cucumber", "Romaine"], "steps": ["Layer each ingredient on a kebab and serve."], "content": ["Yields:  1", "Prep Time:       15 mins", "Total Time:       15 mins"]},
{"name": "Lasagna Grilled Cheese Bites", "ingredients": ["1/4 c. mayonnaise or butter, for grilling bread", "8 slices sourdough bread", "1/2 jar marinara sauce (26-oz.)", "1 container ricotta (14-oz.)", "2 c. shredded mozzarella"], "steps": ["Spread butter or mayonnaise on one side of each slice of bread, putting each slice butter-side-down on a platter or piece of parchment paper. ", "Spread marinara sauce on each slice of bread, then slather on ricotta. Sprinkle mozzarella cheese on every other sandwich, then assemble sandwiches.", "In a frying pan over medium heat, grill sandwiches until each side is lightly golden and the cheese has melted, 1 to 2 minutes per side. ", "Let sandwiches sit for 10 minutes before cutting them into bite-sized pieces. (This keeps the ricotta from spilling out everywhere.) If serving later, place them on a baking sheet in a 200° oven until guests arrive.", "Serve with marinara sauce for dipping."], "content": ["Yields:  24", "Prep Time:       30 mins", "Total Time:       30 mins"]},
{"name": "Garlic Rosemary Chicken", "ingredients": ["1 tsp. plus 2 tbsp. extra-virgin olive oil, divided", "1 head garlic, top sliced off", "4 chicken breasts, pounded 1/2\" thick", "kosher salt", "Freshly ground black pepper", "4 oz. cremini mushrooms, sliced", "2 tbsp. unsalted butter, divided", "1/4 c. white wine", "3/4 c. chicken broth", "3 sprigs fresh rosemary", "5 oz. baby spinach", "Juice of 1/2 a lemon", "Mashed potatoes, for serving"], "steps": ["Preheat oven to 400°. ", "Drizzle a teaspoon of olive oil over garlic and wrap in foil. Bake until golden and soft, about an hour. Set aside to cool, then pick out cloves. Set aside.", "In a large skillet over medium-high heat, heat remaining 2 tablespoons oil. Season chicken breasts with salt and pepper, then sear until golden, about 8 minutes per side. Transfer to a plate. ", "Return skillet to medium heat, add more oil if necessary, then add mushrooms. Season with salt and pepper and cook until slightly wilted, 5 minutes. ", "Add butter and let melt, then stir in the garlic cloves, white wine, chicken broth, and rosemary. Bring to a simmer, nestle back in chicken, and let simmer until sauce has reduced slightly, 6 to 7 minutes. Stir in spinach and lemon juice and let cook until spinach is slightly wilted, about 2 minutes more. ", "Serve with mashed potatoes."], "content": ["Yields:  4", "Prep Time:       35 mins", "Total Time:     1 hr 35 mins"]},
{"name": "Captain America Pizza", "ingredients": ["1 c. pizza sauce", "4 large flour tortillas", "3 c. shredded mozzarella", "2 c. pepperoni", "2 slices mozzarella", "1 c. chopped black olives"], "steps": ["Preheat oven to 350° and line a large baking sheet with parchment paper. Working on the baking sheet, spread a thin layer of pizza sauce onto two tortillas then top each with a thin layer of shredded mozzarella and pepperoni. ", "Place the remaining two tortillas on top. Spread another layer of pizza sauce onto each quesadilla then cover each entirely with mozzarella. ", "Make a large ring of pepperoni, overlapping the slices, around the quesadilla, then make a smaller ring of pepperoni inside. ", "Using a star cookie cutter, arrange black olives in a star shape. ", "Bake for 15 minutes, or until cheese is melted. "], "content": ["Yields:  6 - 8", "Prep Time:       15 mins", "Total Time:       30 mins"]},
{"name": "Mini Breakfast Pizzas", "ingredients": ["2 english muffins, halved", "1 tbsp. butter, plus 1 tablespoon melted butter (optional)", "4 eggs", "1 tbsp. milk", "kosher salt", "Freshly ground pepper", "1/3 c. shredded cheese (see topping ideas below)", "1/4 c. mini pepperoni", "1/3 c. shredded mozzarella", "1 tbsp. finely chopped parsley", "2 slices of bacon, cooked and crumbled", "1/3 c. sharp shredded Cheddar", "1 tbsp. finely chopped chives"], "steps": ["Preheat oven to 350 degrees F. Grease a baking sheet with olive oil or cooking spray.", "Whisk together eggs and cream in a medium bowl until light and frothy.", "Melt butter in a medium nonstick skillet over medium-low heat then add the egg mixture. Stir occasionally with a spatula or wooden spoon. When the eggs are nearly set, season with salt and pepper and remove from heat.", "Place English muffin halves, cut side up on the baking tray. Brush with melted butter, if desired. Sprinkle each piece with your cheese of choice then top with eggs then sprinkle with more cheese. Add desired toppings (see above).", "Bake for 10 minutes, until the cheese is melted and the English muffin is slightly toasted. Garnish with fresh herbs."], "content": ["Yields:  2", "Cook Time:       10 mins", "Total Time:       20 mins"]},
{"name": "Eggo Breakfast Sliders", "ingredients": ["12 sheets of mini Eggo waffles (4 mini waffles per sheet)", "1/2 lb. bacon, chopped into 1” pieces", "1 tbsp. butter", "10 large eggs", "1/4 c. sour cream", "2 tbsp. Chopped chives", "1 c. shredded Cheddar"], "steps": ["Preheat oven to 400 degrees F.", "Arrange frozen mini waffles on 2 large baking sheets and bake until toasted, usually about 5 minutes depending on the brand. The waffles should ", " fit inside the baking sheets. ", "Cook bacon in a large skillet over medium heat until crispy. Drain and clean skillet. ", "Make scrambled eggs: Melt butter in a large nonstick skillet over medium heat. Whisk together eggs and sour cream in a large bowl bowl. Add eggs to the skillet and let set slightly. Reduce heat to low. Drag the eggs with a spatula or wooden spoon to create curds. When the eggs are almost cooked to your liking, season with salt and pepper. Fold in chives and remove from heat. ", "Sprinkle one pan of the waffles with about half of the cheese. Top with scrambled eggs and sprinkle with remaining cheese. Top with bacon and the other waffles. Transfer to oven to bake until the cheese is melted, about 10 minutes.", "Serve warm."], "content": ["Yields:  6 - 8 serving(s)", "Cook Time:       10 mins", "Total Time:       15 mins"]},
{"name": "Sweet Potato Pie Cupcakes", "ingredients": ["1 box yellow cake mix", "1 (15-oz.) can sweet potato puree", "1/2 tsp. cinnamon", "1/4 tsp. nutmeg", "1 c. crushed graham crackers", "4 tbsp. melted butter ", "2 tsp. granulated sugar", "Pinch of kosher salt", "1 c. (2 sticks) butter, softened", "1 (7.5-oz.) container marshmallow crème", "1 1/2 c. powdered sugar", "1 tsp. pure vanilla extract", "Pinch of kosher salt", "Chopped toasted pecans, for garnish", "Cinnamon sugar, for garnish"], "steps": ["Preheat oven to 350° and line a muffin tin with 12 cupcake liners. In a large bowl, mix cake mix with canned sweet potato, cinnamon, and nutmeg until well combined. ", "Make crust: In a large bowl, combine graham cracker crumbs, butter, sugar, and salt in a small bowl. Press about 1 tablespoon of mixture into bottom of each cupcake liner.", "Scoop batter on top of crusts, filling 3/4 full. ", "Bake until cupcakes are golden and a toothpick inserted in middle of a cupcake comes out clean, about 22 minutes. Let cool completely.", "Meanwhile, make marshmallow frosting: In a large bowl, beat together butter and marshmallow crème until combined. Add powdered sugar, vanilla, and salt and beat until smooth. Transfer to a piping bag fitted with a large closed star tip and pipe onto cooled cupcakes.", "Garnish with pecans and cinnamon sugar."], "content": ["Yields:  12", "Prep Time:       20 mins", "Total Time:     1 hr 30 mins"]}
]